OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/CH-K-Lib/startup/DeviceSupport/MK70F15.h
#define DDR_CR41_P1RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR41_P1RDCNT_SHIFT))&DDR_CR41_P1RDCNT_MASK)
#define DDR_CR41_RP1_MASK                        0x30000u
#define DDR_CR41_RP1_SHIFT                       16
#define DDR_CR41_RP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_RP1_SHIFT))&DDR_CR41_RP1_MASK)
#define DDR_CR41_WP1_MASK                        0x3000000u
#define DDR_CR41_WP1_SHIFT                       24
#define DDR_CR41_WP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_WP1_SHIFT))&DDR_CR41_WP1_MASK)
/* CR42 Bit Fields */
#define DDR_CR42_P1TYP_MASK                      0x3u
#define DDR_CR42_P1TYP_SHIFT                     0
#define DDR_CR42_P1TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P1TYP_SHIFT))&DDR_CR42_P1TYP_MASK)
#define DDR_CR42_P2WRCNT_MASK                    0x7FF00u
#define DDR_CR42_P2WRCNT_SHIFT                   8
#define DDR_CR42_P2WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P2WRCNT_SHIFT))&DDR_CR42_P2WRCNT_MASK)
/* CR43 Bit Fields */
#define DDR_CR43_P2RDCNT_MASK                    0x7FFu
#define DDR_CR43_P2RDCNT_SHIFT                   0
#define DDR_CR43_P2RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR43_P2RDCNT_SHIFT))&DDR_CR43_P2RDCNT_MASK)
#define DDR_CR43_RP2_MASK                        0x30000u
#define DDR_CR43_RP2_SHIFT                       16
#define DDR_CR43_RP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_RP2_SHIFT))&DDR_CR43_RP2_MASK)
#define DDR_CR43_WP2_MASK                        0x3000000u
#define DDR_CR43_WP2_SHIFT                       24
#define DDR_CR43_WP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_WP2_SHIFT))&DDR_CR43_WP2_MASK)
/* CR44 Bit Fields */
#define DDR_CR44_P2TYP_MASK                      0x3u
#define DDR_CR44_P2TYP_SHIFT                     0
#define DDR_CR44_P2TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR44_P2TYP_SHIFT))&DDR_CR44_P2TYP_MASK)
#define DDR_CR44_WRRLAT_MASK                     0x100u
#define DDR_CR44_WRRLAT_SHIFT                    8
#define DDR_CR44_WRRSHARE_MASK                   0x10000u
#define DDR_CR44_WRRSHARE_SHIFT                  16
#define DDR_CR44_WRRERR_MASK                     0xF000000u
#define DDR_CR44_WRRERR_SHIFT                    24
#define DDR_CR44_WRRERR(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR44_WRRERR_SHIFT))&DDR_CR44_WRRERR_MASK)
/* CR45 Bit Fields */
#define DDR_CR45_P0PRI0_MASK                     0xFu
#define DDR_CR45_P0PRI0_SHIFT                    0
#define DDR_CR45_P0PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI0_SHIFT))&DDR_CR45_P0PRI0_MASK)
#define DDR_CR45_P0PRI1_MASK                     0xF00u
#define DDR_CR45_P0PRI1_SHIFT                    8
#define DDR_CR45_P0PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI1_SHIFT))&DDR_CR45_P0PRI1_MASK)
#define DDR_CR45_P0PRI2_MASK                     0xF0000u
#define DDR_CR45_P0PRI2_SHIFT                    16
#define DDR_CR45_P0PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI2_SHIFT))&DDR_CR45_P0PRI2_MASK)
#define DDR_CR45_P0PRI3_MASK                     0xF000000u
#define DDR_CR45_P0PRI3_SHIFT                    24
#define DDR_CR45_P0PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI3_SHIFT))&DDR_CR45_P0PRI3_MASK)
/* CR46 Bit Fields */
#define DDR_CR46_P0ORD_MASK                      0x3u
#define DDR_CR46_P0ORD_SHIFT                     0
#define DDR_CR46_P0ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0ORD_SHIFT))&DDR_CR46_P0ORD_MASK)
#define DDR_CR46_P0PRIRLX_MASK                   0x3FF00u
#define DDR_CR46_P0PRIRLX_SHIFT                  8
#define DDR_CR46_P0PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0PRIRLX_SHIFT))&DDR_CR46_P0PRIRLX_MASK)
#define DDR_CR46_P1PRI0_MASK                     0xF000000u
#define DDR_CR46_P1PRI0_SHIFT                    24
#define DDR_CR46_P1PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P1PRI0_SHIFT))&DDR_CR46_P1PRI0_MASK)
/* CR47 Bit Fields */
#define DDR_CR47_P1PRI1_MASK                     0xFu
#define DDR_CR47_P1PRI1_SHIFT                    0
#define DDR_CR47_P1PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI1_SHIFT))&DDR_CR47_P1PRI1_MASK)
#define DDR_CR47_P1PRI2_MASK                     0xF00u
#define DDR_CR47_P1PRI2_SHIFT                    8
#define DDR_CR47_P1PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI2_SHIFT))&DDR_CR47_P1PRI2_MASK)
#define DDR_CR47_P1PRI3_MASK                     0xF0000u
#define DDR_CR47_P1PRI3_SHIFT                    16
#define DDR_CR47_P1PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI3_SHIFT))&DDR_CR47_P1PRI3_MASK)
#define DDR_CR47_P1ORD_MASK                      0x3000000u
#define DDR_CR47_P1ORD_SHIFT                     24
#define DDR_CR47_P1ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1ORD_SHIFT))&DDR_CR47_P1ORD_MASK)
/* CR48 Bit Fields */
#define DDR_CR48_P1PRIRLX_MASK                   0x3FFu
#define DDR_CR48_P1PRIRLX_SHIFT                  0
#define DDR_CR48_P1PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P1PRIRLX_SHIFT))&DDR_CR48_P1PRIRLX_MASK)
#define DDR_CR48_P2PRI0_MASK                     0xF0000u
#define DDR_CR48_P2PRI0_SHIFT                    16
#define DDR_CR48_P2PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI0_SHIFT))&DDR_CR48_P2PRI0_MASK)
#define DDR_CR48_P2PRI1_MASK                     0xF000000u
#define DDR_CR48_P2PRI1_SHIFT                    24
#define DDR_CR48_P2PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI1_SHIFT))&DDR_CR48_P2PRI1_MASK)
/* CR49 Bit Fields */
#define DDR_CR49_P2PRI2_MASK                     0xFu
#define DDR_CR49_P2PRI2_SHIFT                    0
#define DDR_CR49_P2PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI2_SHIFT))&DDR_CR49_P2PRI2_MASK)
#define DDR_CR49_P2PRI3_MASK                     0xF00u
#define DDR_CR49_P2PRI3_SHIFT                    8
#define DDR_CR49_P2PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI3_SHIFT))&DDR_CR49_P2PRI3_MASK)
#define DDR_CR49_P2ORD_MASK                      0x30000u
#define DDR_CR49_P2ORD_SHIFT                     16
#define DDR_CR49_P2ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2ORD_SHIFT))&DDR_CR49_P2ORD_MASK)
/* CR50 Bit Fields */
#define DDR_CR50_P2PRIRLX_MASK                   0x3FFu
#define DDR_CR50_P2PRIRLX_SHIFT                  0
#define DDR_CR50_P2PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR50_P2PRIRLX_SHIFT))&DDR_CR50_P2PRIRLX_MASK)
#define DDR_CR50_CLKSTATUS_MASK                  0x10000u
#define DDR_CR50_CLKSTATUS_SHIFT                 16
/* CR51 Bit Fields */
#define DDR_CR51_DLLRSTDLY_MASK                  0xFFFFu
#define DDR_CR51_DLLRSTDLY_SHIFT                 0
#define DDR_CR51_DLLRSTDLY(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRSTDLY_SHIFT))&DDR_CR51_DLLRSTDLY_MASK)
#define DDR_CR51_DLLRADLY_MASK                   0xFF0000u
#define DDR_CR51_DLLRADLY_SHIFT                  16
#define DDR_CR51_DLLRADLY(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRADLY_SHIFT))&DDR_CR51_DLLRADLY_MASK)
#define DDR_CR51_PHYWRLAT_MASK                   0xF000000u
#define DDR_CR51_PHYWRLAT_SHIFT                  24
#define DDR_CR51_PHYWRLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_PHYWRLAT_SHIFT))&DDR_CR51_PHYWRLAT_MASK)
/* CR52 Bit Fields */
#define DDR_CR52_PYWRLTBS_MASK                   0xFu
#define DDR_CR52_PYWRLTBS_SHIFT                  0
#define DDR_CR52_PYWRLTBS(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PYWRLTBS_SHIFT))&DDR_CR52_PYWRLTBS_MASK)
#define DDR_CR52_PHYRDLAT_MASK                   0xF00u
#define DDR_CR52_PHYRDLAT_SHIFT                  8
#define DDR_CR52_PHYRDLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PHYRDLAT_SHIFT))&DDR_CR52_PHYRDLAT_MASK)
#define DDR_CR52_RDDATAEN_MASK                   0xF0000u
#define DDR_CR52_RDDATAEN_SHIFT                  16
#define DDR_CR52_RDDATAEN(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDATAEN_SHIFT))&DDR_CR52_RDDATAEN_MASK)
#define DDR_CR52_RDDTENBAS_MASK                  0xF000000u
#define DDR_CR52_RDDTENBAS_SHIFT                 24
#define DDR_CR52_RDDTENBAS(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDTENBAS_SHIFT))&DDR_CR52_RDDTENBAS_MASK)
/* CR53 Bit Fields */
#define DDR_CR53_CLKDISCS_MASK                   0x1u
#define DDR_CR53_CLKDISCS_SHIFT                  0
#define DDR_CR53_CRTLUPDMN_MASK                  0xF00u
#define DDR_CR53_CRTLUPDMN_SHIFT                 8
#define DDR_CR53_CRTLUPDMN(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CRTLUPDMN_SHIFT))&DDR_CR53_CRTLUPDMN_MASK)
#define DDR_CR53_CTRLUPDMX_MASK                  0x3FFF0000u
#define DDR_CR53_CTRLUPDMX_SHIFT                 16
#define DDR_CR53_CTRLUPDMX(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CTRLUPDMX_SHIFT))&DDR_CR53_CTRLUPDMX_MASK)
/* CR54 Bit Fields */
#define DDR_CR54_PHYUPDTY0_MASK                  0x3FFFu
#define DDR_CR54_PHYUPDTY0_SHIFT                 0
#define DDR_CR54_PHYUPDTY0(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY0_SHIFT))&DDR_CR54_PHYUPDTY0_MASK)
#define DDR_CR54_PHYUPDTY1_MASK                  0x3FFF0000u
#define DDR_CR54_PHYUPDTY1_SHIFT                 16
#define DDR_CR54_PHYUPDTY1(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY1_SHIFT))&DDR_CR54_PHYUPDTY1_MASK)
/* CR55 Bit Fields */
#define DDR_CR55_PHYUPDTY2_MASK                  0x3FFFu
#define DDR_CR55_PHYUPDTY2_SHIFT                 0
#define DDR_CR55_PHYUPDTY2(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR55_PHYUPDTY2_SHIFT))&DDR_CR55_PHYUPDTY2_MASK)
#define DDR_CR55_PHYUPDTY3_MASK                  0x3FFF0000u
#define DDR_CR55_PHYUPDTY3_SHIFT                 16
#define DDR_CR55_PHYUPDTY3(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR55_PHYUPDTY3_SHIFT))&DDR_CR55_PHYUPDTY3_MASK)
/* CR56 Bit Fields */
#define DDR_CR56_PHYUPDRESP_MASK                 0x3FFFu
#define DDR_CR56_PHYUPDRESP_SHIFT                0
#define DDR_CR56_PHYUPDRESP(x)                   (((uint32_t)(((uint32_t)(x))<<DDR_CR56_PHYUPDRESP_SHIFT))&DDR_CR56_PHYUPDRESP_MASK)
#define DDR_CR56_RDLATADJ_MASK                   0xF0000u
#define DDR_CR56_RDLATADJ_SHIFT                  16
#define DDR_CR56_RDLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR56_RDLATADJ_SHIFT))&DDR_CR56_RDLATADJ_MASK)
#define DDR_CR56_WRLATADJ_MASK                   0xF000000u
#define DDR_CR56_WRLATADJ_SHIFT                  24
#define DDR_CR56_WRLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR56_WRLATADJ_SHIFT))&DDR_CR56_WRLATADJ_MASK)
/* CR57 Bit Fields */
#define DDR_CR57_CMDDLY_MASK                     0xFu
#define DDR_CR57_CMDDLY_SHIFT                    0
#define DDR_CR57_CMDDLY(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CMDDLY_SHIFT))&DDR_CR57_CMDDLY_MASK)
#define DDR_CR57_CLKDISDLY_MASK                  0x700u
#define DDR_CR57_CLKDISDLY_SHIFT                 8
#define DDR_CR57_CLKDISDLY(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CLKDISDLY_SHIFT))&DDR_CR57_CLKDISDLY_MASK)
#define DDR_CR57_CLKENDLY_MASK                   0xF0000u
#define DDR_CR57_CLKENDLY_SHIFT                  16
#define DDR_CR57_CLKENDLY(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CLKENDLY_SHIFT))&DDR_CR57_CLKENDLY_MASK)
#define DDR_CR57_ODTALTEN_MASK                   0x1000000u
#define DDR_CR57_ODTALTEN_SHIFT                  24
/* CR58 Bit Fields */
#define DDR_CR58_Not_Used_MASK                   0xFFFFu
#define DDR_CR58_Not_Used_SHIFT                  0
#define DDR_CR58_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR58_Not_Used_SHIFT))&DDR_CR58_Not_Used_MASK)
#define DDR_CR58_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR58_NOT_USED_SHIFT                  16
#define DDR_CR58_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR58_NOT_USED_SHIFT))&DDR_CR58_NOT_USED_MASK)
/* CR59 Bit Fields */
#define DDR_CR59_Not_Used_MASK                   0xFFFFu
#define DDR_CR59_Not_Used_SHIFT                  0
#define DDR_CR59_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR59_Not_Used_SHIFT))&DDR_CR59_Not_Used_MASK)
#define DDR_CR59_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR59_NOT_USED_SHIFT                  16
#define DDR_CR59_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR59_NOT_USED_SHIFT))&DDR_CR59_NOT_USED_MASK)
/* CR60 Bit Fields */
#define DDR_CR60_Not_Used_MASK                   0xFFFFu
#define DDR_CR60_Not_Used_SHIFT                  0
#define DDR_CR60_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR60_Not_Used_SHIFT))&DDR_CR60_Not_Used_MASK)
#define DDR_CR60_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR60_NOT_USED_SHIFT                  16
#define DDR_CR60_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR60_NOT_USED_SHIFT))&DDR_CR60_NOT_USED_MASK)
/* CR61 Bit Fields */
#define DDR_CR61_Not_Used_MASK                   0xFFFFu
#define DDR_CR61_Not_Used_SHIFT                  0
#define DDR_CR61_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR61_Not_Used_SHIFT))&DDR_CR61_Not_Used_MASK)
#define DDR_CR61_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR61_NOT_USED_SHIFT                  16
#define DDR_CR61_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR61_NOT_USED_SHIFT))&DDR_CR61_NOT_USED_MASK)
/* CR62 Bit Fields */
#define DDR_CR62_Not_Used_MASK                   0xFFFFu
#define DDR_CR62_Not_Used_SHIFT                  0
#define DDR_CR62_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR62_Not_Used_SHIFT))&DDR_CR62_Not_Used_MASK)
#define DDR_CR62_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR62_NOT_USED_SHIFT                  16
#define DDR_CR62_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR62_NOT_USED_SHIFT))&DDR_CR62_NOT_USED_MASK)
/* CR63 Bit Fields */
#define DDR_CR63_Not_Used_MASK                   0xFFFFu
#define DDR_CR63_Not_Used_SHIFT                  0
#define DDR_CR63_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR63_Not_Used_SHIFT))&DDR_CR63_Not_Used_MASK)
#define DDR_CR63_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR63_NOT_USED_SHIFT                  16
#define DDR_CR63_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR63_NOT_USED_SHIFT))&DDR_CR63_NOT_USED_MASK)
/* RCR Bit Fields */
#define DDR_RCR_RST_MASK                         0x40000000u
#define DDR_RCR_RST_SHIFT                        30
/* PAD_CTRL Bit Fields */
#define DDR_PAD_CTRL_SPARE_DLY_CTRL_MASK         0xFu
#define DDR_PAD_CTRL_SPARE_DLY_CTRL_SHIFT        0
#define DDR_PAD_CTRL_SPARE_DLY_CTRL(x)           (((uint32_t)(((uint32_t)(x))<<DDR_PAD_CTRL_SPARE_DLY_CTRL_SHIFT))&DDR_PAD_CTRL_SPARE_DLY_CTRL_MASK)
#define DDR_PAD_CTRL_PAD_ODT_CS0_MASK            0x3000000u
#define DDR_PAD_CTRL_PAD_ODT_CS0_SHIFT           24
#define DDR_PAD_CTRL_PAD_ODT_CS0(x)              (((uint32_t)(((uint32_t)(x))<<DDR_PAD_CTRL_PAD_ODT_CS0_SHIFT))&DDR_PAD_CTRL_PAD_ODT_CS0_MASK)

/**
 * @}
 */ /* end of group DDR_Register_Masks */


/* DDR - Peripheral instance base addresses */
/** Peripheral DDR base address */
#define DDR_BASE                                 (0x400AE000u)
/** Peripheral DDR base pointer */
#define DDR                                      ((DDR_Type *)DDR_BASE)
/** Array initializer of DDR peripheral base pointers */
#define DDR_BASES                                { DDR }

/**
 * @}
 */ /* end of group DDR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

