OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/CH-K-Lib/startup/DeviceSupport/MK70F15.h
/* LSSAR Bit Fields */
#define LCDC_LSSAR_SSA_MASK                      0xFFFFFFFCu
#define LCDC_LSSAR_SSA_SHIFT                     2
#define LCDC_LSSAR_SSA(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LSSAR_SSA_SHIFT))&LCDC_LSSAR_SSA_MASK)
/* LSR Bit Fields */
#define LCDC_LSR_YMAX_MASK                       0x3FFu
#define LCDC_LSR_YMAX_SHIFT                      0
#define LCDC_LSR_YMAX(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LSR_YMAX_SHIFT))&LCDC_LSR_YMAX_MASK)
#define LCDC_LSR_XMAX_MASK                       0x7F00000u
#define LCDC_LSR_XMAX_SHIFT                      20
#define LCDC_LSR_XMAX(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LSR_XMAX_SHIFT))&LCDC_LSR_XMAX_MASK)
/* LVPWR Bit Fields */
#define LCDC_LVPWR_VPW_MASK                      0x7FFu
#define LCDC_LVPWR_VPW_SHIFT                     0
#define LCDC_LVPWR_VPW(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LVPWR_VPW_SHIFT))&LCDC_LVPWR_VPW_MASK)
/* LCPR Bit Fields */
#define LCDC_LCPR_CYP_MASK                       0x3FFu
#define LCDC_LCPR_CYP_SHIFT                      0
#define LCDC_LCPR_CYP(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LCPR_CYP_SHIFT))&LCDC_LCPR_CYP_MASK)
#define LCDC_LCPR_CXP_MASK                       0x3FF0000u
#define LCDC_LCPR_CXP_SHIFT                      16
#define LCDC_LCPR_CXP(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LCPR_CXP_SHIFT))&LCDC_LCPR_CXP_MASK)
#define LCDC_LCPR_OP_MASK                        0x10000000u
#define LCDC_LCPR_OP_SHIFT                       28
#define LCDC_LCPR_CC_MASK                        0xC0000000u
#define LCDC_LCPR_CC_SHIFT                       30
#define LCDC_LCPR_CC(x)                          (((uint32_t)(((uint32_t)(x))<<LCDC_LCPR_CC_SHIFT))&LCDC_LCPR_CC_MASK)
/* LCWHB Bit Fields */
#define LCDC_LCWHB_BD_MASK                       0xFFu
#define LCDC_LCWHB_BD_SHIFT                      0
#define LCDC_LCWHB_BD(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LCWHB_BD_SHIFT))&LCDC_LCWHB_BD_MASK)
#define LCDC_LCWHB_CH_MASK                       0x1F0000u
#define LCDC_LCWHB_CH_SHIFT                      16
#define LCDC_LCWHB_CH(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LCWHB_CH_SHIFT))&LCDC_LCWHB_CH_MASK)
#define LCDC_LCWHB_CW_MASK                       0x1F000000u
#define LCDC_LCWHB_CW_SHIFT                      24
#define LCDC_LCWHB_CW(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LCWHB_CW_SHIFT))&LCDC_LCWHB_CW_MASK)
#define LCDC_LCWHB_BK_EN_MASK                    0x80000000u
#define LCDC_LCWHB_BK_EN_SHIFT                   31
/* LCCMR Bit Fields */
#define LCDC_LCCMR_CUR_COL_B_MASK                0x3Fu
#define LCDC_LCCMR_CUR_COL_B_SHIFT               0
#define LCDC_LCCMR_CUR_COL_B(x)                  (((uint32_t)(((uint32_t)(x))<<LCDC_LCCMR_CUR_COL_B_SHIFT))&LCDC_LCCMR_CUR_COL_B_MASK)
#define LCDC_LCCMR_CUR_COL_G_MASK                0xFC0u
#define LCDC_LCCMR_CUR_COL_G_SHIFT               6
#define LCDC_LCCMR_CUR_COL_G(x)                  (((uint32_t)(((uint32_t)(x))<<LCDC_LCCMR_CUR_COL_G_SHIFT))&LCDC_LCCMR_CUR_COL_G_MASK)
#define LCDC_LCCMR_CUR_COL_R_MASK                0x3F000u
#define LCDC_LCCMR_CUR_COL_R_SHIFT               12
#define LCDC_LCCMR_CUR_COL_R(x)                  (((uint32_t)(((uint32_t)(x))<<LCDC_LCCMR_CUR_COL_R_SHIFT))&LCDC_LCCMR_CUR_COL_R_MASK)
/* LPCR Bit Fields */
#define LCDC_LPCR_PCD_MASK                       0x3Fu
#define LCDC_LPCR_PCD_SHIFT                      0
#define LCDC_LPCR_PCD(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LPCR_PCD_SHIFT))&LCDC_LPCR_PCD_MASK)
#define LCDC_LPCR_SCLKSEL_MASK                   0x80u
#define LCDC_LPCR_SCLKSEL_SHIFT                  7
#define LCDC_LPCR_ACD_MASK                       0x7F00u
#define LCDC_LPCR_ACD_SHIFT                      8
#define LCDC_LPCR_ACD(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LPCR_ACD_SHIFT))&LCDC_LPCR_ACD_MASK)
#define LCDC_LPCR_ACDSEL_MASK                    0x8000u
#define LCDC_LPCR_ACDSEL_SHIFT                   15
#define LCDC_LPCR_REV_VS_MASK                    0x10000u
#define LCDC_LPCR_REV_VS_SHIFT                   16
#define LCDC_LPCR_SWAP_SEL_MASK                  0x20000u
#define LCDC_LPCR_SWAP_SEL_SHIFT                 17
#define LCDC_LPCR_END_SEL_MASK                   0x40000u
#define LCDC_LPCR_END_SEL_SHIFT                  18
#define LCDC_LPCR_SCLKIDLE_MASK                  0x80000u
#define LCDC_LPCR_SCLKIDLE_SHIFT                 19
#define LCDC_LPCR_OEPOL_MASK                     0x100000u
#define LCDC_LPCR_OEPOL_SHIFT                    20
#define LCDC_LPCR_CLKPOL_MASK                    0x200000u
#define LCDC_LPCR_CLKPOL_SHIFT                   21
#define LCDC_LPCR_LPPOL_MASK                     0x400000u
#define LCDC_LPCR_LPPOL_SHIFT                    22
#define LCDC_LPCR_FLMPOL_MASK                    0x800000u
#define LCDC_LPCR_FLMPOL_SHIFT                   23
#define LCDC_LPCR_PIXPOL_MASK                    0x1000000u
#define LCDC_LPCR_PIXPOL_SHIFT                   24
#define LCDC_LPCR_BPIX_MASK                      0xE000000u
#define LCDC_LPCR_BPIX_SHIFT                     25
#define LCDC_LPCR_BPIX(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LPCR_BPIX_SHIFT))&LCDC_LPCR_BPIX_MASK)
#define LCDC_LPCR_PBSIZ_MASK                     0x30000000u
#define LCDC_LPCR_PBSIZ_SHIFT                    28
#define LCDC_LPCR_PBSIZ(x)                       (((uint32_t)(((uint32_t)(x))<<LCDC_LPCR_PBSIZ_SHIFT))&LCDC_LPCR_PBSIZ_MASK)
#define LCDC_LPCR_COLOR_MASK                     0x40000000u
#define LCDC_LPCR_COLOR_SHIFT                    30
#define LCDC_LPCR_TFT_MASK                       0x80000000u
#define LCDC_LPCR_TFT_SHIFT                      31
/* LHCR Bit Fields */
#define LCDC_LHCR_H_WAIT_2_MASK                  0xFFu
#define LCDC_LHCR_H_WAIT_2_SHIFT                 0
#define LCDC_LHCR_H_WAIT_2(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LHCR_H_WAIT_2_SHIFT))&LCDC_LHCR_H_WAIT_2_MASK)
#define LCDC_LHCR_H_WAIT_1_MASK                  0xFF00u
#define LCDC_LHCR_H_WAIT_1_SHIFT                 8
#define LCDC_LHCR_H_WAIT_1(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LHCR_H_WAIT_1_SHIFT))&LCDC_LHCR_H_WAIT_1_MASK)
#define LCDC_LHCR_H_WIDTH_MASK                   0xFC000000u
#define LCDC_LHCR_H_WIDTH_SHIFT                  26
#define LCDC_LHCR_H_WIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<LCDC_LHCR_H_WIDTH_SHIFT))&LCDC_LHCR_H_WIDTH_MASK)
/* LVCR Bit Fields */
#define LCDC_LVCR_V_WAIT_2_MASK                  0xFFu
#define LCDC_LVCR_V_WAIT_2_SHIFT                 0
#define LCDC_LVCR_V_WAIT_2(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LVCR_V_WAIT_2_SHIFT))&LCDC_LVCR_V_WAIT_2_MASK)
#define LCDC_LVCR_V_WAIT_1_MASK                  0xFF00u
#define LCDC_LVCR_V_WAIT_1_SHIFT                 8
#define LCDC_LVCR_V_WAIT_1(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LVCR_V_WAIT_1_SHIFT))&LCDC_LVCR_V_WAIT_1_MASK)
#define LCDC_LVCR_V_WIDTH_MASK                   0xFC000000u
#define LCDC_LVCR_V_WIDTH_SHIFT                  26
#define LCDC_LVCR_V_WIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<LCDC_LVCR_V_WIDTH_SHIFT))&LCDC_LVCR_V_WIDTH_MASK)
/* LPOR Bit Fields */
#define LCDC_LPOR_POS_MASK                       0x1Fu
#define LCDC_LPOR_POS_SHIFT                      0
#define LCDC_LPOR_POS(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LPOR_POS_SHIFT))&LCDC_LPOR_POS_MASK)
/* LPCCR Bit Fields */
#define LCDC_LPCCR_PW_MASK                       0xFFu
#define LCDC_LPCCR_PW_SHIFT                      0
#define LCDC_LPCCR_PW(x)                         (((uint32_t)(((uint32_t)(x))<<LCDC_LPCCR_PW_SHIFT))&LCDC_LPCCR_PW_MASK)
#define LCDC_LPCCR_CC_EN_MASK                    0x100u
#define LCDC_LPCCR_CC_EN_SHIFT                   8
#define LCDC_LPCCR_SCR_MASK                      0x600u
#define LCDC_LPCCR_SCR_SHIFT                     9
#define LCDC_LPCCR_SCR(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LPCCR_SCR_SHIFT))&LCDC_LPCCR_SCR_MASK)
#define LCDC_LPCCR_LDMSK_MASK                    0x8000u
#define LCDC_LPCCR_LDMSK_SHIFT                   15
/* LDCR Bit Fields */
#define LCDC_LDCR_TM_MASK                        0x7Fu
#define LCDC_LDCR_TM_SHIFT                       0
#define LCDC_LDCR_TM(x)                          (((uint32_t)(((uint32_t)(x))<<LCDC_LDCR_TM_SHIFT))&LCDC_LDCR_TM_MASK)
#define LCDC_LDCR_HM_MASK                        0x7F0000u
#define LCDC_LDCR_HM_SHIFT                       16
#define LCDC_LDCR_HM(x)                          (((uint32_t)(((uint32_t)(x))<<LCDC_LDCR_HM_SHIFT))&LCDC_LDCR_HM_MASK)
#define LCDC_LDCR_BURST_MASK                     0x80000000u
#define LCDC_LDCR_BURST_SHIFT                    31
/* LRMCR Bit Fields */
#define LCDC_LRMCR_SELF_REF_MASK                 0x1u
#define LCDC_LRMCR_SELF_REF_SHIFT                0
/* LICR Bit Fields */
#define LCDC_LICR_INTCON_MASK                    0x1u
#define LCDC_LICR_INTCON_SHIFT                   0
#define LCDC_LICR_INTSYN_MASK                    0x4u
#define LCDC_LICR_INTSYN_SHIFT                   2
#define LCDC_LICR_GW_INT_CON_MASK                0x10u
#define LCDC_LICR_GW_INT_CON_SHIFT               4
/* LIER Bit Fields */
#define LCDC_LIER_BOF_EN_MASK                    0x1u
#define LCDC_LIER_BOF_EN_SHIFT                   0
#define LCDC_LIER_EOF_EN_MASK                    0x2u
#define LCDC_LIER_EOF_EN_SHIFT                   1
#define LCDC_LIER_UDR_ERR_EN_MASK                0x8u
#define LCDC_LIER_UDR_ERR_EN_SHIFT               3
#define LCDC_LIER_GW_BOF_EN_MASK                 0x10u
#define LCDC_LIER_GW_BOF_EN_SHIFT                4
#define LCDC_LIER_GW_EOF_EN_MASK                 0x20u
#define LCDC_LIER_GW_EOF_EN_SHIFT                5
#define LCDC_LIER_GW_UDR_ERR_EN_MASK             0x80u
#define LCDC_LIER_GW_UDR_ERR_EN_SHIFT            7
/* LISR Bit Fields */
#define LCDC_LISR_BOF_MASK                       0x1u
#define LCDC_LISR_BOF_SHIFT                      0
#define LCDC_LISR_EOF_MASK                       0x2u
#define LCDC_LISR_EOF_SHIFT                      1
#define LCDC_LISR_UDR_ERR_MASK                   0x8u
#define LCDC_LISR_UDR_ERR_SHIFT                  3
#define LCDC_LISR_GW_BOF_MASK                    0x10u
#define LCDC_LISR_GW_BOF_SHIFT                   4
#define LCDC_LISR_GW_EOF_MASK                    0x20u
#define LCDC_LISR_GW_EOF_SHIFT                   5
#define LCDC_LISR_GW_UDR_ERR_MASK                0x80u
#define LCDC_LISR_GW_UDR_ERR_SHIFT               7
/* LGWSAR Bit Fields */
#define LCDC_LGWSAR_GWSA_MASK                    0xFFFFFFFCu
#define LCDC_LGWSAR_GWSA_SHIFT                   2
#define LCDC_LGWSAR_GWSA(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWSAR_GWSA_SHIFT))&LCDC_LGWSAR_GWSA_MASK)
/* LGWSR Bit Fields */
#define LCDC_LGWSR_GWH_MASK                      0x3FFu
#define LCDC_LGWSR_GWH_SHIFT                     0
#define LCDC_LGWSR_GWH(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LGWSR_GWH_SHIFT))&LCDC_LGWSR_GWH_MASK)
#define LCDC_LGWSR_GWW_MASK                      0x7F00000u
#define LCDC_LGWSR_GWW_SHIFT                     20
#define LCDC_LGWSR_GWW(x)                        (((uint32_t)(((uint32_t)(x))<<LCDC_LGWSR_GWW_SHIFT))&LCDC_LGWSR_GWW_MASK)
/* LGWVPWR Bit Fields */
#define LCDC_LGWVPWR_GWVPW_MASK                  0x7FFu
#define LCDC_LGWVPWR_GWVPW_SHIFT                 0
#define LCDC_LGWVPWR_GWVPW(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LGWVPWR_GWVPW_SHIFT))&LCDC_LGWVPWR_GWVPW_MASK)
/* LGWPOR Bit Fields */
#define LCDC_LGWPOR_GWPO_MASK                    0x1Fu
#define LCDC_LGWPOR_GWPO_SHIFT                   0
#define LCDC_LGWPOR_GWPO(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWPOR_GWPO_SHIFT))&LCDC_LGWPOR_GWPO_MASK)
/* LGWPR Bit Fields */
#define LCDC_LGWPR_GWYP_MASK                     0x3FFu
#define LCDC_LGWPR_GWYP_SHIFT                    0
#define LCDC_LGWPR_GWYP(x)                       (((uint32_t)(((uint32_t)(x))<<LCDC_LGWPR_GWYP_SHIFT))&LCDC_LGWPR_GWYP_MASK)
#define LCDC_LGWPR_GWXP_MASK                     0x3FF0000u
#define LCDC_LGWPR_GWXP_SHIFT                    16
#define LCDC_LGWPR_GWXP(x)                       (((uint32_t)(((uint32_t)(x))<<LCDC_LGWPR_GWXP_SHIFT))&LCDC_LGWPR_GWXP_MASK)
/* LGWCR Bit Fields */
#define LCDC_LGWCR_GWCKB_MASK                    0x3Fu
#define LCDC_LGWCR_GWCKB_SHIFT                   0
#define LCDC_LGWCR_GWCKB(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWCR_GWCKB_SHIFT))&LCDC_LGWCR_GWCKB_MASK)
#define LCDC_LGWCR_GWCKG_MASK                    0xFC0u
#define LCDC_LGWCR_GWCKG_SHIFT                   6
#define LCDC_LGWCR_GWCKG(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWCR_GWCKG_SHIFT))&LCDC_LGWCR_GWCKG_MASK)
#define LCDC_LGWCR_GWCKR_MASK                    0x3F000u
#define LCDC_LGWCR_GWCKR_SHIFT                   12
#define LCDC_LGWCR_GWCKR(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWCR_GWCKR_SHIFT))&LCDC_LGWCR_GWCKR_MASK)
#define LCDC_LGWCR_GW_RVS_MASK                   0x200000u
#define LCDC_LGWCR_GW_RVS_SHIFT                  21
#define LCDC_LGWCR_GWE_MASK                      0x400000u
#define LCDC_LGWCR_GWE_SHIFT                     22
#define LCDC_LGWCR_GWCKE_MASK                    0x800000u
#define LCDC_LGWCR_GWCKE_SHIFT                   23
#define LCDC_LGWCR_GWAV_MASK                     0xFF000000u
#define LCDC_LGWCR_GWAV_SHIFT                    24
#define LCDC_LGWCR_GWAV(x)                       (((uint32_t)(((uint32_t)(x))<<LCDC_LGWCR_GWAV_SHIFT))&LCDC_LGWCR_GWAV_MASK)
/* LGWDCR Bit Fields */
#define LCDC_LGWDCR_GWTM_MASK                    0x7Fu
#define LCDC_LGWDCR_GWTM_SHIFT                   0
#define LCDC_LGWDCR_GWTM(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWDCR_GWTM_SHIFT))&LCDC_LGWDCR_GWTM_MASK)
#define LCDC_LGWDCR_GWHM_MASK                    0x7F0000u
#define LCDC_LGWDCR_GWHM_SHIFT                   16
#define LCDC_LGWDCR_GWHM(x)                      (((uint32_t)(((uint32_t)(x))<<LCDC_LGWDCR_GWHM_SHIFT))&LCDC_LGWDCR_GWHM_MASK)
#define LCDC_LGWDCR_GWBT_MASK                    0x80000000u
#define LCDC_LGWDCR_GWBT_SHIFT                   31
/* LAUSCR Bit Fields */
#define LCDC_LAUSCR_AGWCKB_MASK                  0xFFu
#define LCDC_LAUSCR_AGWCKB_SHIFT                 0
#define LCDC_LAUSCR_AGWCKB(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCR_AGWCKB_SHIFT))&LCDC_LAUSCR_AGWCKB_MASK)
#define LCDC_LAUSCR_AGWCKG_MASK                  0xFF00u
#define LCDC_LAUSCR_AGWCKG_SHIFT                 8
#define LCDC_LAUSCR_AGWCKG(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCR_AGWCKG_SHIFT))&LCDC_LAUSCR_AGWCKG_MASK)
#define LCDC_LAUSCR_AGWCKR_MASK                  0xFF0000u
#define LCDC_LAUSCR_AGWCKR_SHIFT                 16
#define LCDC_LAUSCR_AGWCKR(x)                    (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCR_AGWCKR_SHIFT))&LCDC_LAUSCR_AGWCKR_MASK)
#define LCDC_LAUSCR_AUS_Mode_MASK                0x80000000u
#define LCDC_LAUSCR_AUS_Mode_SHIFT               31
/* LAUSCCR Bit Fields */
#define LCDC_LAUSCCR_ACUR_COL_B_MASK             0xFFu
#define LCDC_LAUSCCR_ACUR_COL_B_SHIFT            0
#define LCDC_LAUSCCR_ACUR_COL_B(x)               (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCCR_ACUR_COL_B_SHIFT))&LCDC_LAUSCCR_ACUR_COL_B_MASK)
#define LCDC_LAUSCCR_ACUR_COL_G_MASK             0xFF00u
#define LCDC_LAUSCCR_ACUR_COL_G_SHIFT            8
#define LCDC_LAUSCCR_ACUR_COL_G(x)               (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCCR_ACUR_COL_G_SHIFT))&LCDC_LAUSCCR_ACUR_COL_G_MASK)
#define LCDC_LAUSCCR_ACUR_COL_R_MASK             0xFF0000u
#define LCDC_LAUSCCR_ACUR_COL_R_SHIFT            16
#define LCDC_LAUSCCR_ACUR_COL_R(x)               (((uint32_t)(((uint32_t)(x))<<LCDC_LAUSCCR_ACUR_COL_R_SHIFT))&LCDC_LAUSCCR_ACUR_COL_R_MASK)

/**
 * @}
 */ /* end of group LCDC_Register_Masks */


